


MIP6 Working Group                                          Hee Jin Jang
Internet-Draft                                               Alper Yegin
Expires: August 17, 2007                                     SAMSUNG AIT
                                                        Kuntal Chowdhury
                                                        Starent Networks
                                                          JinHyeock Choi
                                                             SAMSUNG AIT
                                                       February 13, 2007


          DHCP Option for Home Information Discovery in MIPv6
                      draft-ietf-mip6-hiopt-02.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on August 17, 2007.

Copyright Notice

   Copyright (C) The IETF Trust (2007).










Jang, et al.             Expires August 17, 2007                [Page 1]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


Abstract

   This draft defines a DHCP-based scheme to enable dynamic discovery of
   Mobile IPv6 home agent address, home address, and home subnet.  New
   DHCP options are defined to carry the information from a DHCP server
   to the DHCP client running on the mobile node.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  4
   3.  DHCP options for HA Dynamic Discovery  . . . . . . . . . . . .  5
     3.1.  Home Network Identifier Option . . . . . . . . . . . . . .  5
     3.2.  MIP6 Relay Agent Option  . . . . . . . . . . . . . . . . .  7
       3.2.1.  MIP6 Relay Agent Sub-option  . . . . . . . . . . . . .  8
     3.3.  Home Network Information Option  . . . . . . . . . . . . .  9
       3.3.1.  Home Network Information Sub-option  . . . . . . . . . 10
   4.  Option Usage . . . . . . . . . . . . . . . . . . . . . . . . . 13
     4.1.  Mobile Node Behavior . . . . . . . . . . . . . . . . . . . 13
     4.2.  NAS/DHCP Relay Agent Behavior  . . . . . . . . . . . . . . 13
     4.3.  DHCP Server Behavior . . . . . . . . . . . . . . . . . . . 15
   5.  Security Considerations  . . . . . . . . . . . . . . . . . . . 17
   6.  IANA Consideration . . . . . . . . . . . . . . . . . . . . . . 18
   7.  Normative References . . . . . . . . . . . . . . . . . . . . . 19
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 21
   Intellectual Property and Copyright Statements . . . . . . . . . . 22
























Jang, et al.             Expires August 17, 2007                [Page 2]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


1.  Introduction

   Before a mobile node can engage in Mobile IPv6 signaling with a home
   agent, it should either know the IP address of the home agent via
   pre-configuration, or dynamically discover it.  Mobile IPv6
   specification [6] describes how home agents can be dynamically
   discovered by mobile nodes that know the home subnet prefix.  This
   scheme does not work when prefix information is not already available
   to the mobile node.  This problem can be solved by delivering one or
   more home subnet prefix information to the mobile node by means of
   DHCP.  Subsequently, the mobile node can engage in dynamic home agent
   discovery using the prefix information.  In addition to delivering
   the prefix information, DHCP can also be used to provide the IP
   addresses or FQDNs of the home agents that are available to the
   mobile node and the home address that the mobile node can use to
   register with the home agent.

   The solution involves defining new DHCP options to carry home subnet
   prefix, home agent IP address, home agent's FQDN information, and
   home address of the mobile node.  A similar solution has already been
   defined for Mobile IPv4 home agents [10].

   As part of configuring the initial TCP/IP parameters, a mobile node
   can obtain home network information for the subnet it is directly
   attached to, other subnets in the visited domain, or a subnet from
   its home domain.  A mobile node can convey the target home subnet's
   identity in order to receive corresponding information.  For example
   the mobile node can provide realm portion of its user NAI (Network
   Access Identifier) and expect that a home network information from
   its home domain is returned.  The availability of the requested
   information depends on the DHCP server having prior knowledge or
   dynamically discovering it.  While the specific details are outside
   the scope of this document, use of static tables and AAA-assisted
   discovery are possible options [12].

   The mobile node may or may not be connected to the "home" subnet when
   it attempts to learn Mobile IPv6 home network information.  This
   allows operators to centrally deploy home agents while being able to
   bootstrap mobile nodes that are already roaming.  This scenario also
   occurs when HMIP [11] is used, where the mobile node is required to
   discover the MAP (a special home agent) that is located multiple hops
   away from the mobile node's attachment point.









Jang, et al.             Expires August 17, 2007                [Page 3]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


2.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC2119 [2].

   General mobility terminology can be found in RFC3753 [5].  The
   following additional terms, as defined in RFC4640 [9], are used in
   this document:

   Access Service Provider (ASP): A network operator that provides
   direct IP packet forwarding to and from the mobile node.

   Mobility Service Provider (MSP): A service provider that provides
   Mobile IPv6 service.  In order to obtain such service, the mobile
   node must be authenticated and authorized to obtain the Mobile IPv6
   service.


































Jang, et al.             Expires August 17, 2007                [Page 4]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


3.  DHCP options for HA Dynamic Discovery

   This section introduces new DHCP options used for dynamic home
   information discovery in Mobile IPv6.

3.1.  Home Network Identifier Option

   This option is used to carry the identifier of the target home
   network.  The mobile node MUST include this option along with its
   Option Request option in its request.

   It is assumed that the DHCP server has some mechanism to know or
   retrieve the requested Mobile IPv6 information such as [12].  For
   instance, the NAS can learn the information via RADIUS during network
   access authentication, and NAS-collocated DHCP relay can transfer it
   to the DHCP server by the proposed DHCP option in this document.  The
   DHCP server may gather the home network information in other ways,
   but the specifics of these mechanisms are outside the scope of this
   document.
































Jang, et al.             Expires August 17, 2007                [Page 5]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       OPTION_MIP6-HNID        |           option-len          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     id-type   |A|   reserved  |                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
   .                                                               .
   .                    Home Network Identifier                    .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

          option-code

             OPTION_MIP6-HNID (TBD)

          option-len

             Total length of the option in octets

          id-type

             The type of Home Network Identifier:

                     0    Visited domain (local ASP)

                     1    Home domain (home MSP)

                     2    No preference

          A flag

             This flag to specify whether the client requests a home
             address or not.

          reserved

             7-bit field reserved for future use.  The value MUST be
             initialized to 0 by the sender and MUST be ignored by
             the receiver.

          Home Network Identifier

             The identifier to specify the requested home network of the
             mobile node. This field is set to the network realm as the
             FQDN defined in [3] when id-type is 0 or 1.


   Id-type 0 indicates the mobile node is interested in learning the



Jang, et al.             Expires August 17, 2007                [Page 6]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


   home network information that pertains to the currently visited
   network.  This type can be used to discover local home agents in the
   local ASP.  The Home Network Identifier field can be set to 0 or the
   target home MSP.  In case the DHCP server is not configured with the
   local home information, the home information for the specified home
   MSP is provided.

   Id-type 1 indicates the mobile node is interested in learning the
   home network information that pertains to the given realm.  This type
   can be used to discover home agents that are hosted by a user's home
   domain (as indicated by his/her NAI-based username -- user@
   HomeRealm).  The Home Network Identifier field MUST be set to the
   target home MSP.  In case there is no available home information for
   the specified home MSP in the DHCP server, the local home information
   is provided.

   If the mobile node has no preference, the id-type is set to 2 and the
   Home Network Identifier SHOULD be initialized to 0.  In this case,
   the assignment of the home network information is within the server's
   own discretion.  For the detailed processing, refer to Section 4.

   If the A flag is set to 1 in this option, the server SHOULD assign a
   home address to the client in the returned Home Network Information
   option.  Otherwise, the server MUST not assign a home address.

3.2.  MIP6 Relay Agent Option

   This option carries the RADIUS or Diameter attributes that are
   received at the NAS from the AAAH.  The DHCP relay agent sends this
   option to the DHCP server in the Relay-Forward message.


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       OPTION_MIP6-RELAY       |           option-len          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   .                          sub-options                          .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         option-code

               OPTION_MIP6-RELAY (TBD).

         option-len

               Total length of the option in octets

         sub-options



Jang, et al.             Expires August 17, 2007                [Page 7]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


               A series of sub-options carrying MIP6 bootstrap
               information.


3.2.1.  MIP6 Relay Agent Sub-option

   This sub-option carries the assigned home network information to the
   DHCP server.


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  sub-opt-code |  sub-opt-len  |   reserved    |               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+               +
   .                                                               .
   .                   Home Network Information                    .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         sub-opt-code

               The sub-option identifies the type of the following
               Home Network Information field. Possible values are:

                     0    Home subnet prefix

                     1    Complete IPv6 address of the home agent

                     2    FQDN of the home agent

                     3    IPv6 Home address

         sub-opt-len

               8-bit unsigned integer. Total length of the following
               Home Network Information field.

         reserved

               8-bit field reserved for future use.  The value MUST be
               initialized to 0 by the sender, and MUST be ignored by
               the receiver.

         Home Network Information

               A home subnet prefix, home agent IP address, FQDN
               or home address to be delivered to the DHCP server.




Jang, et al.             Expires August 17, 2007                [Page 8]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


   When the sub-opt-code is set to 0, the data field MUST contain the
   8-bit prefix length information followed by the 128-bit IPv6 address
   beginning with the available network prefix.

   When the sub-opt-code is set to 1, the data field MUST contain the
   128-bit IPv6 address of the home agent.

   When the sub-opt-code is set to 2, the data field MUST contain the
   FQDN as described in RFC1035 [1].

   When the sub-opt-code is set to 3, the data field MUST contain the
   8-bit prefix length field of the following home address, the 32-bit
   lifetime of the following home address and the 128-bit home address
   to be assigned to a client.  The lifetime is expressed in units of
   seconds.

   Multiple sub-options may exist in a MIP6 Relay Agent option to carry
   more than one home information.

3.3.  Home Network Information Option

   This option is used to carry home network information to a mobile
   node in the form of one or more of home subnet prefix(es), home agent
   address(es), home agent FQDN(s) and mobile node's home address(es).

   The server SHOULD provide all of the matching home information in a
   Home Network Information option.  If the mobile node set the A flag
   to 1 in Home Network Identifier option, the DHCP server SHOULD reply
   with available home address(es) to the mobile node.


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       OPTION_MIP6-HNINF       |           option-len          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   .                          sub-options                          .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         option-code

               OPTION_MIP6-HNINF (TBD).

         option-len

               Total length of the option in octets

         sub-options
               A series of sub-options carrying MIP6 bootstrap



Jang, et al.             Expires August 17, 2007                [Page 9]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


               information.


3.3.1.  Home Network Information Sub-option

   This sub-option carries the assigned home network information to the
   DHCP client.












































Jang, et al.             Expires August 17, 2007               [Page 10]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  sub-opt-code |  sub-opt-len  |V|  reserved   |               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+               +
   .                                                               .
   .                   Home Network Information                    .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         sub-opt-code

               The type of the following Home Network Information field.
               Possible values are:

                     0    Home subnet prefix

                     1    Complete IPv6 address of the home agent

                     2    FQDN of the home agent

                     3    IPv6 Home address

         sub-opt-len

               8-bit unsigned integer. Total length of the following
               Home Network Information field.

         V flag

               This flag specifies whether the information is
               assigned by the visited network or not.

         reserved

               7-bit field reserved for future use.  The value MUST be
               initialized to 0 by the sender, and MUST be ignored by
               the receiver.

         Home Network Information

               A home subnet prefix, home agent IP address, FQDN
               or home address to be assigned to a mobile node.


   The sub-opt-code, sub-opt-len and Home Network Information fields are
   set in the same manner as sub-opt-code, sub-opt-len and Home Network
   Information fields of the MIP6 Relay Agent sub-option.




Jang, et al.             Expires August 17, 2007               [Page 11]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


   The home address SHOULD be provided if and only if the client sets
   the A flag in Home Network Identifier option.  Setting the lifetime
   to 0xffffffff ("infinity") means a permanent assignment of an address
   to the client.  The lifetime of the assigned home address SHOULD not
   be longer than the lifetime of its prefix since the home address
   cannot survive the prefix lifetime.

   Multiple sub-options may exist in a Home Network Information option
   to carry more than one home information.

   The detailed processing for each id-type is described in Section 4.








































Jang, et al.             Expires August 17, 2007               [Page 12]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


4.  Option Usage

   The requesting and sending of the proposed DHCP options follow the
   rules for DHCP options in [4].  The following DHCP options [4] are
   also required in the solution for normal DHCP operation:

   - Option Request option

   - Client Identifier option

   - Relay Message option

   - Interface-Id option

4.1.  Mobile Node Behavior

   In order to acquire the home network information, the mobile node
   SHALL send an Information Request to the
   All_DHCP_Relay_Agents_and_Servers multicast address.  In this message
   the mobile node (DHCP client) SHALL include the Option Code for Home
   Network Identifier option in the OPTION_ORO.  The mobile node SHALL
   also include the OPTION_CLIENTID [4] to identify itself to the DHCP
   server.

   During requesting the information, the mobile node MUST clarify the
   preference about the requested home network with the id-type in the
   Home Network Identifier option.  Even if the mobile node does not
   care about the location of the home network where the home agent to
   be assigned, it MUST clarify the fact by setting the id-type to 2.
   In this case the Home Network Identifier MUST be set to 0.

   When the mobile node receives the Reply message from the DHCP server
   and gets more than one home agent address(es), it MUST have a
   selection mechanism to determine which one to use for establishing a
   Mobile IPv6 session.  For example, if the mobile node acquires both
   IPv6 address(es) and FQDN(s) of the home agents, it may try to use
   the address information of the home agent(s) first.

   When the mobile node requests the home network information with id-
   type 0 or 1 but cannot be provided with the proper information, that
   is, option-len = 0 in the Home Network Information option, then it
   may request again by setting the id-type to 2 in the Home Network
   Identifier option.

4.2.  NAS/DHCP Relay Agent Behavior

   The NAS and the DHCP relay agent are assumed to be collocated in this
   solution.  The NAS communicates with the mobile node during the



Jang, et al.             Expires August 17, 2007               [Page 13]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


   network access authentication and interacts with the AAAH (via the
   AAAV) using either Diameter NASREQ RFC4005 [7] or RADIUS [12]
   [Editor's note: The Diameter AVPs need to be defined].

   Upon receiving the MIP6 related RADIUS or Diameter attributes
   returned by the AAAH, the NAS passes the information to the
   collocated DHCP relay agent.

   Upon receiving the Information Request from the mobile node, the DHCP
   relay agent MUST forward the message to the DHCP server as per [4].
   The relay agent SHALL use the OPTION_CLIENTID to identify the mobile
   node (user).  This is required to check whether there are some
   additional information for the user that need to be appended while
   relaying the information request message to the DHCP server.  If the
   relay agent determines that the NAS has passed home network
   information for this mobile node, the relay agent MUST include the
   received home network information in the MIP6 Relay Agent option, and
   attach this option in the Relay-Forward message.  The relay agent MAY
   include the Interface-Id option [4] in the Relay-Forward message.

   The sub-options that carry home informatinon for the same home agent
   should be listed in sequential order in the MIP6 Relay Agent
   option so as to indicate the coupling among home network information.
   For example, if HA1 is coupled with HoA1, and HA2 with HoA2 and HoA3,
   then the sub-options are listed as follows.

   sub-opt-code = 1 (HA1's IPv6 address)

   sub-opt-code = 2 (HA1's FQDN)

   sub-opt-code = 3 (HoA1)

   sub-opt-code = 0 (Home subnet prefix under HA2)

   sub-opt-code = 2 (HA2's FQDN)

   sub-opt-code = 3 (HoA2)

   sub-opt-code = 3 (HoA3)

   The DHCP relay agent MUST insert MN-NAI option [8] in the Relay-
   Forward message in order to indicate the home netowrk of the user to
   the DHCP server.

   Upon receiving the Reply message from the DHCPv6 server, the relay
   agent SHALL follow the guidelines defined in [4] to forward the
   message to the mobile node.




Jang, et al.             Expires August 17, 2007               [Page 14]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


4.3.  DHCP Server Behavior

   The DHCP server MUST follow the following logic to process
   Information Request from the mobile node.

   Information Request message includes:

   A. OPTION_ORO and Home Network Identifier option with id-type 0,
   Interface-Id option, Client Identifier option, MIP6 Relay Agent
   option.

   If the DHCP server is configured with the local home information, it
   MUST set the V flag to 1, and include the corresponding information
   in the Home Network Information option of the Reply message.  If it
   is not configured with the local home information but has the home
   information of the requested domain in the Home Network Identifier,
   it SHOULD set the V flag to 0 and include the corresponding
   information.  The information may have been configured statically in
   the server or may be extracted from the received MIP6 Relay Agent
   option.

   B. OPTION_ORO and Home Network Identifier option with id-type 1,
   Interface-Id option, Client Identifier option, MIP6 Relay Agent
   option.

   If The received Home Network Identifier option does not carry any
   home MSP, the option is ignored.

   If the DHCP server has the corresponding information for the
   specified home MSP, it MUST set the V flag to 0, and include the
   corresponding information in the Home Network Information option.
   The server may provide the matching information extracted from the
   MIP6 Relay Agent option.  If it has no home information for the
   requested domain but has the local home information, it SHOULD set
   the V flag to 1 and include the local home information.

   C. OPTION_ORO and Home Network Identifier option with id-type 2,
   Interface-Id option, Client Identifier option, MIP6 Relay Agent
   option.

   In this case, the assignment of the home information relies on the
   server's local policy, and the DHCP server SHOULD have its own policy
   so that it can reply with the proper information.  The policy can be
   determined based on several factors such as the home agent
   availability and the authorization information of the mobile node.
   However, the specific policy setting is not in the scope of this
   document.




Jang, et al.             Expires August 17, 2007               [Page 15]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


   In all cases, when the DHCP server provides the home information that
   is retrieved from the MIP6 Relay Agent option, it SHOULD compare the
   NAI's realm information of MN-NAI option with the target network in
   Home Network Identifier option.  If they match, the DHCP server
   replies with the Reply message after copying the home information in
   MIP6 Relay Agent option to Home Network Information option and
   setting the V flag to 0.

   In case the server cannot not find any home information neither for
   the local network nor for the home MSP, it MUST return a Home Network
   Information option with the 0-length data.

   The sub-options for the same home agent SHOULD be listed in
   sequential order in the Home Network Information option.

   When a DHCP server assigns a home address to an mobile node, it
   should guarantee that the lifetime of assigned home address MUST NOT
   be greater than that of the subnet prefix in the mobile node's home
   address.  The lifetimes of the home addresses for assignments are can
   be negotiated when the home prefix is delivered from the home agent,
   or configured by DHCP administrator's policy.  The details are
   outside the scope of this document.

   In all Reply messages, the DHCP server MUST return the Interface-Id
   option as received in the Information Request.  The DHCP server
   SHOULD use the Client Identifier option to identify the mobile node.

























Jang, et al.             Expires August 17, 2007               [Page 16]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


5.  Security Considerations

   Secure delivery of home agent, home address, and home link
   information from a DHCP server to the mobile node (DHCP client)
   relies on the overall DHCP security.  The particular option defined
   in this draft does not have additional impact on the DHCP security.

   Aside from the DHCP client to server interaction, an operator must
   also ensure secure delivery of mobile IP information to the DHCP
   server.  This is outside the scope of DHCP and the newly defined
   option.








































Jang, et al.             Expires August 17, 2007               [Page 17]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


6.  IANA Consideration

   This document introduces two new DHCPv6 options, Home Agent Request
   option and Home Agent Reply option.  The type numbers for new DHCP
   options are currently TBD.  An appropriate request will be made to
   IANA if this Internet draft gets accepted as an RFC.













































Jang, et al.             Expires August 17, 2007               [Page 18]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


7.  Normative References

   [1]   Mockapetris, P., "Domain names - implementation and
         specification", STD 13, RFC 1035, November 1987.

   [2]   Bradner, S., "Key words for use in RFCs to Indicate Requirement
         Levels", BCP 14, RFC 2119, March 1997.

   [3]   Aboba, B. and M. Beadles, "The Network Access Identifier",
         RFC 2486, January 1999.

   [4]   Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C., and M.
         Carney, "Dynamic Host Configuration Protocol for IPv6
         (DHCPv6)", RFC 3315, July 2003.

   [5]   Manner, J. and M. Kojo, "Mobility Related Terminology",
         RFC 3753, June 2004.

   [6]   Johnson, D., Perkins, C., and J. Arkko, "Mobility Support in
         IPv6", RFC 3775, June 2004.

   [7]   Calhoun, P., Zorn, G., Spence, D., and D. Mitton, "Diameter
         Network Access Server Application", RFC 4005, August 2005.

   [8]   Patel, A., Leung, K., Khalil, M., Akhtar, H., and K. Chowdhury,
         "Mobile Node Identifier Option for Mobile IPv6 (MIPv6)",
         RFC 4283, November 2005.

   [9]   Patel, A. and G. Giaretta, "Problem Statement for bootstrapping
         Mobile IPv6 (MIPv6)", RFC 4640, September 2006.

   [10]  Levkowetz, H., "DHCP Option for Mobile IP Mobility Agents",
         draft-ietf-dhc-mipadvert-opt-02 (work in progress),
         February 2004.

   [11]  Soliman, H., Castelluccia, C., Malki, K., and L. Bellier,
         "Hierarchical Mobile IPv6 mobility management (HMIPv6)",
         draft-ietf-mipshop-hmipv6-04 (work in progress), December 2004.

   [12]  Chowdhury, K., "RADIUS Mobile IPv6 Support",
         draft-ietf-mip6-radius-01 (work in progress), October 2006.

   [13]  Chowdhury, K. and A. Yegin, "MIP6-bootstrapping for the
         Integrated Scenario",
         draft-ietf-mip6-bootstrapping-integrated-dhc-02 (work in
         progress), February 2007.

   [14]  Giaretta, G., "Mobile IPv6 bootstrapping in split scenario",



Jang, et al.             Expires August 17, 2007               [Page 19]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


         draft-ietf-mip6-bootstrapping-split-04 (work in progress),
         December 2006.

















































Jang, et al.             Expires August 17, 2007               [Page 20]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


Authors' Addresses

   Hee Jin Jang
   Samsung Advanced Institute of Technology
   P.O. Box 111
   Suwon 440-600
   Korea

   Email: heejin.jang@samsung.com


   Alper E. Yegin
   Samsung Advanced Institute of Technology
   Istanbul
   Turkey

   Email: alper01.yegin@partner.samsung.com


   Kuntal Chowdhury
   Starent Networks
   30 International Place
   Tewksbury, MA  01876
   US

   Email: kchowdhury@starentnetworks.com


   JinHyeok Choi
   Samsung Advanced Institute of Technology
   P.O. Box 111
   Suwon 440-600
   Korea

   Email: athene@sait.samsung.co.kr
















Jang, et al.             Expires August 17, 2007               [Page 21]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6  February 2007


Full Copyright Statement

   Copyright (C) The IETF Trust (2007).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Acknowledgment

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Jang, et al.             Expires August 17, 2007               [Page 22]


